## Study of effect of national factors that influence home prices in US in the past 20 years

**Task** - Using publically available data for the national factors that impact supply and demand of homes in US, build a model to study the effect of these variables on home prices.

**Approach**- The following variables are chosen for the study

| KEY FACTOR                        | 
| --------------------------------- |  
| Unemployment Rate                 |
| Per Capita GDP                    |                      
| Median Household Income           |
| Construction Prices               |
| CPI (Consumer Price Index)                               |
| Interest Rates                    |
| Number of new houses supplied     |
| Working Population                |
| Urban Population                  |
| Percentage of population above 65 |
| Housing subsidies                 |
| Number of Households              |

As a proxy to the home prices, S&P CASE-SHILLER Index is used.

Most of the data is downloaded from [https://fred.stlouisfed.org/].

Data for all the variables is downloaded, preprocessed and combined to create a datset. Data for different variables had different frequencies. So, to combine the data, necessary changes are made.

In [2]:
# Impoprt Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
# Loading CASE-SHILLER data

shiller = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\HPI.xls', skiprows=1)

shiller = shiller[shiller["Date"] >= "2001-01-01"]

In [4]:
# Read the first 5 rows of the Case chiller index 
shiller.head()

         Date  CSUSHPISA
12 2001-01-01    109.846
13 2001-02-01    110.500
14 2001-03-01    111.109
15 2001-04-01    111.652
16 2001-05-01    112.164

In [5]:
# Check the data type of data
shiller.dtypes

Date         datetime64[ns]
CSUSHPISA           float64
dtype: object

In [6]:
# Extract year from date and create year column
shiller['Year'] = shiller['Date'].dt.year

In [7]:
# Extract month from date and create month column
shiller['Month'] = shiller['Date'].dt.month

In [8]:
shiller.head()

         Date  CSUSHPISA  Year  Month
12 2001-01-01    109.846  2001      1
13 2001-02-01    110.500  2001      2
14 2001-03-01    111.109  2001      3
15 2001-04-01    111.652  2001      4
16 2001-05-01    112.164  2001      5

In [9]:
shiller.dtypes

Date         datetime64[ns]
CSUSHPISA           float64
Year                  int64
Month                 int64
dtype: object

In [10]:
# Checking data shape
shiller.shape

(272, 4)

In [11]:
# Reading Unemployment Rate Data into a dataframe
unemp = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\UNEMPLOYMENT.xls', \
                      names = ['Date', 'unemp'])
unemp.head()

        Date  unemp
0 2000-01-01    4.0
1 2000-02-01    4.1
2 2000-03-01    4.0
3 2000-04-01    3.8
4 2000-05-01    4.0

In [12]:
#checking unemployment data shape
unemp.shape

(284, 2)

In [13]:
# Per Capita GDP Data 
pcgdp = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\PER CAPITA GDP.xls', \
                      names = ['Date', 'per_capita_GDP'])
pcgdp.tail()

         Date  per_capita_GDP
90 2022-07-01           77875
91 2022-10-01           79000
92 2023-01-01           80126
93 2023-04-01           80781
94 2023-07-01           82335

In [14]:
# Checking Per Capita GDP data shape
pcgdp.shape

(95, 2)

In [15]:
# Interest Rate Data    
interest = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\INTEREST.xls', \
                      names = ['Date', 'Interest'])
interest.head()

        Date  Interest
0 2000-01-01      5.95
1 2000-02-01      6.01
2 2000-03-01      6.14
3 2000-04-01      6.28
4 2000-05-01      6.71

In [16]:
# Checking Per Interest rate data shape
interest.shape

(284, 2)

In [17]:
# Consumer Price Index

cpi = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\CONSUMER PRICE INDEX.xls', \
                      names = ['Date', 'CPI'])
cpi.head()

        Date    CPI
0 2000-01-01  169.3
1 2000-02-01  170.0
2 2000-03-01  171.0
3 2000-04-01  170.9
4 2000-05-01  171.2

In [18]:
# Checking CPI data shape
interest.shape

(284, 2)

In [19]:
# new house supply
houses = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\CONSUMER PRICE INDEX.xls', \
                      names = ['Date', 'Houses'])
houses.tail()

          Date   Houses
281 2023-06-01  303.841
282 2023-07-01  304.348
283 2023-08-01  306.269
284 2023-09-01  307.481
285 2023-10-01  307.619

In [20]:
houses.shape

(286, 2)

In [21]:
# Population above 65

oldpop =  pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\AGE 65 AND ABOVE.xls', \
                      names = ['Date', 'Old_pop'])
oldpop.head()

        Date    Old_pop
0 2000-01-01  12.317630
1 2001-01-01  12.296945
2 2002-01-01  12.287458
3 2003-01-01  12.277934
4 2004-01-01  12.304719

In [22]:
# Checking Population of age 65 and above data shape
oldpop.shape

(23, 2)

In [23]:
# Urban Population Percent

urbanpop =  pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\AGE 65 AND ABOVE.xls', \
                      names = ['Date', 'Urban_pop'])
urbanpop.head()

        Date  Urban_pop
0 2000-01-01  12.317630
1 2001-01-01  12.296945
2 2002-01-01  12.287458
3 2003-01-01  12.277934
4 2004-01-01  12.304719

In [24]:
# Checking Population prcentage of urban data shape
urbanpop.shape

(23, 2)

In [25]:
# Housing Subsidies (in billion dollars)

subsidy =  pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\GOVERNMENT SUBSIDIES.xls', \
                      names = ['Date', 'Subsidy'])
subsidy.head()

        Date  Subsidy
0 2000-01-01   19.690
1 2001-01-01   20.573
2 2002-01-01   24.183
3 2003-01-01   25.930
4 2004-01-01   27.201

In [26]:
subsidy.shape

(23, 2)

In [27]:
# Working Population (In persons)

working = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\WORKING POP.xls', \
                      names = ['Date', 'working_pop'])

working.head()

        Date   working_pop
0 2000-01-01  1.782921e+08
1 2000-02-01  1.783433e+08
2 2000-03-01  1.784055e+08
3 2000-04-01  1.785807e+08
4 2000-05-01  1.787272e+08

In [28]:
working['working_pop'] = working['working_pop'].apply(lambda x: '{:.1f}'.format(x))

In [29]:
working.head()

        Date  working_pop
0 2000-01-01  178292111.5
1 2000-02-01  178343252.4
2 2000-03-01  178405530.6
3 2000-04-01  178580673.3
4 2000-05-01  178727196.9

In [30]:
# Checking working population data shape
working.shape

(286, 2)

In [31]:
# Median Household Income

income = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\INCOME.xls', \
                      names = ['Date', 'Income'])

income.head()

        Date  Income
0 2000-01-01   67470
1 2001-01-01   66360
2 2002-01-01   65820
3 2003-01-01   65860
4 2004-01-01   65760

In [32]:
income.shape

(23, 2)

In [33]:
# Number of Household (In thousands)
household = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\TOTAL HOUSEHOLDS.xls', \
                      names = ['Date', 'Num_household'])
household.head()

        Date  Num_household
0 2000-01-01         104705
1 2001-01-01         108209
2 2002-01-01         109297
3 2003-01-01         111278
4 2004-01-01         112000

In [34]:
household.shape

(24, 2)

In [35]:
# Reading Construction Price Index

construction_price = pd.read_excel(r'F:\JUPTER NOTEBOOK\RAVI SHANKAR PROJECTS\US HOME PRICES\CONSTRUCTION PRICE INDEX.xls', \
                      names = ['Date', 'const_price_index'])
construction_price.head()

        Date  const_price_index
0 2000-01-01              144.1
1 2000-02-01              144.7
2 2000-03-01              145.4
3 2000-04-01              145.6
4 2000-05-01              144.9

In [36]:
construction_price.shape

(284, 2)

In [37]:
# Merge case chiller, unemp, Interest, CPI, const_price_index, working_pop, new house supply on the basis of Date
df = pd.merge(shiller, unemp, on = 'Date', how='left')
df = pd.merge(df,interest,on = 'Date', how='left' )
df = pd.merge(df,cpi, on = 'Date', how='left')
df = pd.merge(df,construction_price, on= 'Date', how= 'left')
df = pd.merge(df, working, on= 'Date', how= 'left')
df = pd.merge(df, houses, on= 'Date', how= 'left')

df.head()

,Date,CSUSHPISA,Year,Month,unemp,Interest,CPI,const_price_index,working_pop,Houses
0,2001-01-01,109.846,2001,1,4.2,5.62,175.6,142.0,180416623.5,175.6
1,2001-02-01,110.500,2001,2,4.2,5.26,176.0,142.4,180577730.8,176.0
2,2001-03-01,111.109,2001,3,4.3,4.89,176.1,142.4,180636104.8,176.1
3,2001-04-01,111.652,2001,4,4.4,4.53,176.4,142.5,180905518.2,176.4
4,2001-05-01,112.164,2001,5,4.3,4.02,177.3,144.2,181014608.3,177.3

In [38]:
df.shape

(272, 10)

In [39]:
df = pd.merge(df, pcgdp, on= 'Date', how= 'left')
df.head()

,Date,CSUSHPISA,Year,Month,unemp,Interest,CPI,const_price_index,working_pop,Houses,per_capita_GDP
0,2001-01-01,109.846,2001,1,4.2,5.62,175.6,142.0,180416623.5,175.6,36845.0
1,2001-02-01,110.500,2001,2,4.2,5.26,176.0,142.4,180577730.8,176.0,NaN
2,2001-03-01,111.109,2001,3,4.3,4.89,176.1,142.4,180636104.8,176.1,NaN
3,2001-04-01,111.652,2001,4,4.4,4.53,176.4,142.5,180905518.2,176.4,37211.0
4,2001-05-01,112.164,2001,5,4.3,4.02,177.3,144.2,181014608.3,177.3,NaN

The "Per_Capita_GDP" column has missing values because the data was quarterly. The missing values in the other columns 
is due to unavailability of fresh data. We will first fill the missing values in the "Per_Capita_GDP" column using linear interpolation.

In [39]:
df['per_capita_GDP'] = df['per_capita_GDP'].interpolate()

In [40]:
df.head()

,Date,CSUSHPISA,Year,Month,unemp,Interest,CPI,const_price_index,working_pop,Houses,per_capita_GDP
0,2001-01-01,109.846,2001,1,4.2,5.62,175.6,142.0,180416623.5,175.6,36845.000000
1,2001-02-01,110.500,2001,2,4.2,5.26,176.0,142.4,180577730.8,176.0,36967.000000
2,2001-03-01,111.109,2001,3,4.3,4.89,176.1,142.4,180636104.8,176.1,37089.000000
3,2001-04-01,111.652,2001,4,4.4,4.53,176.4,142.5,180905518.2,176.4,37211.000000
4,2001-05-01,112.164,2001,5,4.3,4.02,177.3,144.2,181014608.3,177.3,37177.333333

In [41]:
# Merge Rest of the column with df database by creating a year column 
cols = [household, income, subsidy, urbanpop, oldpop]

for df1 in cols:
    df1['Year'] = df1['Date'].dt.year
    df1.set_index("Date", inplace = True)
    df = pd.merge(df, df1, how ='left', on = 'Year')

In [42]:
df.tail()

,Date,CSUSHPISA,Year,Month,unemp,Interest,CPI,const_price_index,working_pop,Houses,per_capita_GDP,Num_household,Income,Subsidy,Urban_pop,Old_pop
267,2023-04-01,300.198,2023,4,3.4,5.03,302.918,333.366,208392885.8,302.918,80781.0,131434,NaN,NaN,NaN,NaN
268,2023-05-01,302.620,2023,5,3.7,5.15,303.294,337.473,208612844.2,303.294,81299.0,131434,NaN,NaN,NaN,NaN
269,2023-06-01,304.651,2023,6,3.6,5.22,303.841,337.336,208706920.0,303.841,81817.0,131434,NaN,NaN,NaN,NaN
270,2023-07-01,306.634,2023,7,3.5,5.35,304.348,334.576,208779237.3,304.348,82335.0,131434,NaN,NaN,NaN,NaN
271,2023-08-01,309.404,2023,8,3.8,5.44,306.269,333.980,208906586.8,306.269,82335.0,131434,NaN,NaN,NaN,NaN

We dont have records for the Subsidy, Income, Urban_pop, Old_pop for 2023 so therefore we delete those record containing Nan values

In [43]:
df.dropna(inplace=True)

In [44]:
df

,Date,CSUSHPISA,Year,Month,unemp,Interest,CPI,const_price_index,working_pop,Houses,per_capita_GDP,Num_household,Income,Subsidy,Urban_pop,Old_pop
0,2001-01-01,109.846,2001,1,4.2,5.62,175.600,142.000,180416623.5,175.600,36845.000000,108209,66360.0,20.573,12.296945,12.296945
1,2001-02-01,110.500,2001,2,4.2,5.26,176.000,142.400,180577730.8,176.000,36967.000000,108209,66360.0,20.573,12.296945,12.296945
2,2001-03-01,111.109,2001,3,4.3,4.89,176.100,142.400,180636104.8,176.100,37089.000000,108209,66360.0,20.573,12.296945,12.296945
3,2001-04-01,111.652,2001,4,4.4,4.53,176.400,142.500,180905518.2,176.400,37211.000000,108209,66360.0,20.573,12.296945,12.296945
4,2001-05-01,112.164,2001,5,4.3,4.02,177.300,144.200,181014608.3,177.300,37177.333333,108209,66360.0,20.573,12.296945,12.296945
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,2022-08-01,301.596,2022,8,3.7,2.76,295.320,342.753,207370651.0,295.320,78250.000000,131202,74580.0,48.021,17.128121,17.128121
260,2022-09-01,299.380,2022,9,3.5,3.21,296.539,336.464,207453580.5,296.539,78625.000000,131202,74580.0,48.021,17.128121,17.128121
261,2022-10-01,298.922,2022,10,3.7,3.85,297.987,333.796,207431164.7,297.987,79000.000000,131202,74580.0,48.021,17.128121,17.128121
262,2022-11-01,298.312,2022,11,3.6,4.46,298.598,330.369,207521914.2,298.598,79375.333333,131202,74580.0,48.021,17.128121,17.128121
263,2022-12-01,297.471,2022,12,3.5,4.51,298.990,326.449,207524486.3,298.990,79750.666667,131202,74580.0,48.021,17.128121,17.128121

In [304]:
df.to_csv('data preparation.csv', index=False)